{
  "title": "Projects",
  "see-website": "See Website",
  "gamehongo": {
    "subtitle": "The best way of learning a language is actually using it.",
    "description": "In GameHongo you can find games and channels suitable for your current japanese level.\nThe website is a list-like system in which users can rate how difficult is the language of games and videos.",
    "care-experience": "There was a lot of care to ensure the user experience was snap and intuitive.",
    "redis": "Redis was utilized for caching common searches",
    "optimistic": "Every edition on information utilizes optimistic updates",
    "ssr": "Pages have server or static rendering",
    "responsive": "Responsive Design",
    "oauth": "OAuth Login",
    "view-button": "View it Here"
  },
  "amdocs": {
    "title": "Fullstack Developer Amdocs",
    "introduction": "While in Amdocs, I participate as a fullstack developer in the development of an web tool for creation telephony packages to Oi Company.",
    "main-task": "I contributed to the improviment of the Spring Boot Java server, managed the OracleSQL database, and created new pages using HTML/jQuery.",
    "other-tasks": "I also created a bash tool for converting GitLab commits to ClearCase. Greatly improving the velocity of building new releases.",
    "view-button": "View it Here"
  },
  "hero-ai": {
    "title": "Hero Creation AI",
    "subtitle": "Create your Super Hero with just one click ",
    "description": "In this website you can quickly create a new hero with AI generated image and backstory.\nThe project was utilized to polish my front-end and design skills.",
    "challenges": "I encountered a significant challenge related to the time-consuming nature of AI generation. To address this issue, I implemented the following measures:",
    "paralalized": "Parallelizing the backstory and image generation processes.",
    "loading-bar": "Incorporating a spinning wheel and loading bar to enhance user experience and provide real-time feedback.",
    "view-button": "View it Here"
  }
}
