{
  "title": "Projetos",
  "see-website": "Veja o site",
  "gamehongo": {
    "subtitle": "A melhor maneira de aprender um idioma é usando ele.",
    "description": "No GameHongo, você pode descobrir jogos e canais que correspondem ao seu nível atual de japonês. O site apresenta um sistema em formato de lista onde os usuários podem avaliar a dificuldade do idioma usado em jogos e vídeos.",
    "care-experience": "No desenvolvimento, tive bastânte cuidado para criar uma experiência de usuário intuitiva e responsivo.",
    "redis": "Utilização do Redis para cache de pesquisas comuns",
    "optimistic": "Implementação de atualizações otimistas para todas as edições de informações",
    "ssr": "Suporte à renderização do lado do servidor ou renderização estática para as páginas",
    "responsive": "Design responsivo",
    "oauth": "Fornecimento de funcionalidade de login com OAuth",
    "view-button": "Entre no site"
  },
  "amdocs": {
    "title": "Desenvolvedor Fullstack Amdocs",
    "introduction": "Na Amdocs, participei como desenvolvedor fullstack do desenvolvimento de uma ferramenta web para criação de pacotes de telefonia para a Empresa Oi.",
    "main-task": "Eu contribui para a melhoria do servidor Java Spring Boot, eu construi requests para o banco de dados OracleSQL com PL/SQL e construi novas páginas com HTML/jQuery.",
    "other-tasks": "Além disso, criei uma série de comandos bash para converter commits do GitLab para ClearCase. Aumentando drasticamente a velocidade de build de novas releases.",
    "view-button": "Entre no site"
  },
  "cookies": {
    "title": "Whimsy Cookie Workshop",
    "subtitle": "Os Cookies Artesanais de Sanca",
    "introduction": "Website para um restaurante de cookies. O site inteiro foi construido para ter uma vibe de 'cool/hippie'. Foi utilizado várias animações suaves do Framer Motion e uma paleta de cores multi-colorida.",
    "view-button": "Entre no site",
    "git-button": "Código"
  },
  "hero-ai": {
    "title": "Criação de herois AI",
    "subtitle": "Crie seu super-herói com apenas um clique",
    "description": "Neste site você consegue criar rapidamente um novo herói com imagem de perfil e backstory geradas por IA.\n O projeto foi utilizado para polir minhas habilidades de front-end e design.",
    "challenges": "Um dos desafios encontrados foi a demora excessina na geração de conteúdo pela IA. Para resolver isso:",
    "paralalized": "Foi paralizado a geração de backstory e a geração de imagem.",
    "loading-bar": "Foi incorporado uma spinning wheel e uma barra de loading. Melhorando o feed-back ao usuário",
    "view-button": "Entre no site"
  }
}
